// Написати умовну конструкцію, яка в залежності від часу доби виводитиме відповідне привітання. 
// Потрібно отримати реальний час доби із системи. Зробити 2 способами через 2 різних умовних оператора.
// В діапазоні годин 23-5 – має виводитися привітання “Доброї ночі”
// В діапазоні годин 5-11 – має виводитися привітання “Доброго ранку”
// В діапазоні годин 11-17 – має виводитися привітання “Доброго дня”
// В діапазоні годин 17-23 – має виводитися привітання “Доброго вечора”.


let date = new Date();
let hours = date.getHours();


console.log(hours)

//variant 1

// if (hours >= 23 || hours <= 4 ){
//     alert('Доброї ночі')
// } else if(hours === 0){
//     alert('Доброї ночі')
// } else if(hours >= 5 && hours <= 10 ){
//     alert('Доброго ранку')
// } else if(hours >= 11 && hours <= 16 ){
//     alert('Доброго дня')
// }else if(hours >= 17 && hours <= 22 ){
//     alert('Доброго вечора')
// };


//varian 2 

// switch (true) {
//     case (hours >= 23):
//     case (hours >= 0):
//         alert('Доброї ночі');
//         break;
//     case (hours >= 5):
//         alert('Доброго ранку');
//         break;
//     case (hours >= 11):
//         alert('Доброго дня');
//         break;
//     case (hours >= 17):
//         alert('Доброго вечора');
//         break;
// }

//***********or************/

//switch (hours){
    // case 23:
    // case 0:
    // case 1:
    // case 2:
    // case 3:
     //case 4:
         //alert('Доброї ночі');
         //break;
    
    // case 5:
    // case 6:
    // case 7:
    // case 8:
    // case 9:
    // case 10:
    //     alert('Доброго ранку');
    //     break;
    // case 11:
    // case 12:
    // case 13:
    // case 14:
    // case 15:
    // case 16:
    //     alert('Доброго дня');
    //     break;
    // case 17:
    // case 18:
    // case 19:
    // case 20:
    // case 21:
    // case 22:
    //     alert('Доброго вечора');
    //     break;



//}

