// Створіть порожній масив;
// 1) У перший елемент масиву запишіть будь-яке число;
// 2) У другій елемент масиву запишіть будь-який рядок;
// 3) У третій елемент масиву запишіть будь-логічне значення;
// 4) У четвертий елемент масиву запишіть значення null;
// 5) Виведіть на екран число елементів, яке зберігається в масиві;
// 6) Запитайте у користувача ввести будь-яке значення і запишіть це значення в п'ятий елемент масиву;
// 7) Виведіть на екран п'ятий елемент масиву.
// 8) Видаліть 1-ий елемент масиву і виведіть масив на екран.

let someArray = [];
someArray[0] = 8;
someArray[1] = 'some string in someArray';
someArray[2] = true;
someArray[3] = null;
console.log(someArray.length);


someArray[4] = prompt('Please type something');
console.log(someArray[4])

console.log(someArray.shift(0))

console.log(someArray)

